ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_rtdma_ch_regs.xml
<module id="RTDMA_CH_REGS" HW_revision="" description="RTDMA CH Registers">
	<register id="MODE" width="32" page="0" offset="0x0" instances="1" instaddr="4" internal="0" description="Mode Register">
		<bitfield id="PERINTSEL" description="Peripheral Interrupt and Sync Select" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="OVRINTE" description="Overflow Interrupt Enable" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="PERINTE" description="Peripheral Interrupt Enable" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="CHINTMODE" description="Channel Interrupt Mode" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="ONESHOT" description="One Shot Mode Bit" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="CONTINUOUS" description="Continuous Mode Bit" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="DATASIZE" description="Data Size Mode Bit" begin="18" end="17" width="2" rwaccess="RW"/>
		<bitfield id="CHINTE" description="Channel Interrupt Enable Bit" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="WRT_DATASIZE" description="Write Data Size Mode Bit" begin="21" end="20" width="2" rwaccess="RW"/>
	</register>
	<register id="CONTROL" width="32" page="0" offset="0x4" instances="1" instaddr="4" internal="0" description="Control Register">
		<bitfield id="RUN" description="Run Bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="HALT" description="Halt Bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SOFTRESET" description="Soft Reset Bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="PERINTFRC" description="Interrupt Force Bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="PERINTCLR" description="Interrupt Clear Bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="ERRCLR" description="Error Clear Bit" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="PERINTFLG" description="Interrupt Flag Bit" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="TRANSFERSTS" description="Transfer Status Bit" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="BURSTSTS" description="Burst Status Bit" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="RUNSTS" description="Run Status Bit" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="OVRFLG" description="Overflow Flag Bit" begin="14" end="14" width="1" rwaccess="R"/>
	</register>
	<register id="BURST_SIZE" width="32" page="0" offset="0x8" instances="1" instaddr="4" internal="0" description="Burst Size Register">
		<bitfield id="BURSTSIZE" description="Burst Transfer Size" begin="7" end="0" width="8" rwaccess="RW"/>
	</register>
	<register id="BURST_COUNT" width="32" page="0" offset="0xc" instances="1" instaddr="4" internal="0" description="Burst Count Register">
		<bitfield id="BURSTCOUNT" description="Burst Transfer Size" begin="7" end="0" width="8" rwaccess="R"/>
	</register>
	<register id="SRC_BURST_STEP" width="32" page="0" offset="0x10" instances="1" instaddr="4" internal="0" description="Source Burst Step Register">
		<bitfield id="SRCBURSTSTEP" description="Source post-increment/decrement step size of a burst" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="DST_BURST_STEP" width="32" page="0" offset="0x14" instances="1" instaddr="4" internal="0" description="Destination Burst Step Register">
		<bitfield id="DSTBURSTSTEP" description="Destination post-increment/decrement step size of a burst" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="TRANSFER_SIZE" width="32" page="0" offset="0x18" instances="1" instaddr="4" internal="0" description="Transfer Size Register">
		<bitfield id="TRANSFERSIZE" description="These bits specify the number of bursts to transfer:" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="TRANSFER_COUNT" width="32" page="0" offset="0x1c" instances="1" instaddr="4" internal="0" description="Transfer Count Register">
		<bitfield id="TRANSFERCOUNT" description="These bits specify the current transfer counter value:" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="SRC_TRANSFER_STEP" width="32" page="0" offset="0x20" instances="1" instaddr="4" internal="0" description="Source Transfer Step Register">
		<bitfield id="SRCTRANSFERSTEP" description="Source post-increment/decrement step size of a transfer" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="DST_TRANSFER_STEP" width="32" page="0" offset="0x24" instances="1" instaddr="4" internal="0" description="Destination Transfer Step Register">
		<bitfield id="DSTTRANSFERSTEP" description="Destination post-increment/decrement step size of a transfer" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="SRC_WRAP_SIZE" width="32" page="0" offset="0x28" instances="1" instaddr="4" internal="0" description="Source Wrap Size Register">
		<bitfield id="WRAPSIZE" description="Number of bursts to transfer before wrapping" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="SRC_WRAP_COUNT" width="32" page="0" offset="0x2c" instances="1" instaddr="4" internal="0" description="Source Wrap Count Register">
		<bitfield id="WRAPSIZE" description="These bits indicate the current wrap counter value:" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="SRC_WRAP_STEP" width="32" page="0" offset="0x30" instances="1" instaddr="4" internal="0" description="Source Wrap Step Register">
		<bitfield id="WRAPSTEP" description="Source post-increment/decrement step size for a wrap" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="DST_WRAP_SIZE" width="32" page="0" offset="0x34" instances="1" instaddr="4" internal="0" description="Destination Wrap Size Register">
		<bitfield id="WRAPSIZE" description="Number of bursts to transfer before wrapping" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="DST_WRAP_COUNT" width="32" page="0" offset="0x38" instances="1" instaddr="4" internal="0" description="Destination Wrap Count Register">
		<bitfield id="WRAPSIZE" description="These bits indicate the current wrap counter value:" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="DST_WRAP_STEP" width="32" page="0" offset="0x3c" instances="1" instaddr="4" internal="0" description="Destination Wrap Step Register">
		<bitfield id="WRAPSTEP" description="Destination post-increment/decrement step size for a wrap" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="SRC_BEG_ADDR_SHADOW" width="32" page="0" offset="0x40" instances="1" instaddr="4" internal="0" description="Source Begin Address Shadow Register">
		<bitfield id="BEGADDR" description="32-bit address value" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SRC_ADDR_SHADOW" width="32" page="0" offset="0x44" instances="1" instaddr="4" internal="0" description="Source Address Shadow Register">
		<bitfield id="ADDR" description="32-bit address value" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SRC_BEG_ADDR_ACTIVE" width="32" page="0" offset="0x48" instances="1" instaddr="4" internal="0" description="Source Begin Address Active Register">
		<bitfield id="BEGADDR" description="32-bit address value" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="SRC_ADDR_ACTIVE" width="32" page="0" offset="0x4c" instances="1" instaddr="4" internal="0" description="Source Address Active Register">
		<bitfield id="ADDR" description="32-bit address value" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="DST_BEG_ADDR_SHADOW" width="32" page="0" offset="0x50" instances="1" instaddr="4" internal="0" description="Destination Begin Address Shadow Register">
		<bitfield id="BEGADDR" description="32-bit address value" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="DST_ADDR_SHADOW" width="32" page="0" offset="0x54" instances="1" instaddr="4" internal="0" description="Destination Address Shadow Register">
		<bitfield id="ADDR" description="32-bit address value" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="DST_BEG_ADDR_ACTIVE" width="32" page="0" offset="0x58" instances="1" instaddr="4" internal="0" description="Destination Begin Address Active Register">
		<bitfield id="BEGADDR" description="32-bit address value" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="DST_ADDR_ACTIVE" width="32" page="0" offset="0x5c" instances="1" instaddr="4" internal="0" description="Destination Address Active Register">
		<bitfield id="ADDR" description="32-bit address value" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="CHSECLAT1" width="32" page="0" offset="0x80" instances="1" instaddr="4" internal="0" description="Channel Security Details Latch Register">
		<bitfield id="ZONE" description="Channel owner zone" begin="3" end="0" width="4" rwaccess="R"/>
		<bitfield id="LINK" description="Channel owner Link" begin="11" end="8" width="4" rwaccess="R"/>
		<bitfield id="APILINK" description="Channel owner Clink" begin="19" end="16" width="4" rwaccess="R"/>
		<bitfield id="STACK" description="Channel owner Stack" begin="27" end="24" width="4" rwaccess="R"/>
	</register>
	<register id="CHSECLAT2" width="32" page="0" offset="0x84" instances="1" instaddr="4" internal="0" description="Channel Security Details Latch Register">
		<bitfield id="SECURE" description="Channel SECURE Information" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="PRIV" description="Channel PRIV information" begin="9" end="8" width="2" rwaccess="R"/>
		<bitfield id="PRIVID" description="Channel PRIVID information" begin="23" end="16" width="8" rwaccess="R"/>
	</register>
	<register id="BURST_INTF_CTRL" width="32" page="0" offset="0xa0" instances="1" instaddr="4" internal="0" description="Burst Interface Control Register">
		<bitfield id="BURSTCTRL" description="Control Burst Interface operation" begin="1" end="0" width="2" rwaccess="RW"/>
	</register>
	<register id="CHCFG_LOCK" width="32" page="0" offset="0x100" instances="1" instaddr="4" internal="0" description="Channel Configuration Temporary Lock">
		<bitfield id="LOCK" description="Temporary Lock" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="CHCFG_COMMIT" width="32" page="0" offset="0x104" instances="1" instaddr="4" internal="0" description="Channel Configuration Permanent Commit">
		<bitfield id="COMMIT" description="Permanent Commit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
</module>
